export default {
  "404.explore": "एक्सप्लोर पर जाएं",
  "404.home": "होम पर जाएं",
  "404.luck": "मुझे भाग्यशाली महसूस हो रहा है",
  "404.message": "पेज नहीं मिला, सस",
  "cookieBanner.close": "बंद करें",
  "cookieBanner.message":
    "हम आपके अनुभव को बेहतर बनाने के लिए कुकीज़ का उपयोग करते हैं। टाइपहीरो का उपयोग करके, आप हमारे कुकीज़ के उपयोग से सहमत हैं।",
  "cookieBanner.ok": "ठीक है",
  "cookieBanner.title": "कैटलॉग्स डिजिटाइजेशन कुकीज़ का उपयोग करता है 🍪",
  "general.contribute.github": "गिटहब पर योगदान करें",
  "general.difficulty.BEGINNER": "शुरुआती",
  "general.difficulty.EASY": "आसान",
  "general.difficulty.EVENT": "इवेंट",
  "general.difficulty.EXTREME": "अत्यंत",
  "general.difficulty.HARD": "कठिन",
  "general.difficulty.MEDIUM": "मध्यम",
  "general.join.discord": "डिस्कॉर्ड में शामिल हों",
  "landing.community.byDevforDev": "डेवलपर्स द्वारा, डेवलपर्स के लिए",
  "landing.community.description":
    "टाइपहीरो मुफ्त, ओपन-सोर्स है, और आप जैसे डेवलपर्स द्वारा बनाया गया है। ये कुछ ऐसे योगदानकर्ता हैं जिन्होंने अब तक इसे संभव बनाया है।",
  "landing.community.title": "समुदाय द्वारा निर्मित",
  "landing.features.badge": "बहुत सारे फीचर्स, वाह",
  "landing.features.collaborativeEnvironment.description":
    "डेवलपर्स कमेंटिंग के माध्यम से समाधान साझा कर सकते हैं और चर्चा में भाग ले सकते हैं",
  "landing.features.collaborativeEnvironment.title":
    "सहयोगी वातावरण",
  "landing.features.curatedTracks.description":
    "ट्रैक्स क्यूरेटेड चुनौतियां हैं, जो विभिन्न विषयों और कठिनाई के स्तरों पर फैली हुई हैं, आपके टाइपस्क्रिप्ट कौशल को बढ़ाने के लिए।",
  "landing.features.curatedTracks.title": "लर्निंग ट्रैक्स",
  "landing.features.description": "टाइपस्क्रिप्ट मेनेस बनने के लिए आपको सब कुछ",
  "landing.features.imageCard.description":
    "टाइपस्क्रिप्ट चुनौतियों में भाग लेकर टाइप सिस्टम और उन्नत फीचर्स की पकड़ मजबूत करें",
  "landing.features.imageCard.title": "टाइप चुनौतियां",
  "landing.features.title": "टाइपहीरो में क्या है?",
  "landing.hero.challenge1.prompt":
    "नंबर और स्ट्रिंग का यूनियन टाइप लागू करें",
  "landing.hero.challenge1.title":
    "नंबर और स्ट्रिंग का यूनियन टाइप लागू करें",
  "landing.hero.challenge2.prompt": "एक स्ट्रिंग लिटरल को नंबर में बदलें",
  "landing.hero.challenge2.title": "स्ट्रिंग से नंबर",
  "landing.hero.description":
    "टाइपस्क्रिप्ट डेवलपर्स के समुदाय से जुड़ें, सहयोग करें, और बढ़ें। इंटरैक्टिव कोडिंग चुनौतियों, चर्चाओं, और ज्ञान साझा करने के माध्यम से अपने कौशल को ऊंचा उठाएं",
  "landing.hero.explore": "एक्सप्लोर करें",
  "landing.hero.ghStars": "गिटहब पर हमें स्टार दें",
  "landing.hero.start_exploring": "एक्सप्लोरिंग शुरू करें",
  "landing.newsletter.description":
    "प्लेटफॉर्म के भविष्य में रुचि रखते हैं? कंटेंट, नए फीचर्स, और अधिक पर अपडेट पाने के लिए पहले बनें!",
  "landing.newsletter.subscribe": "हमारे न्यूज़लेटर की सदस्यता लें",
  "landing.newsletter.title": "अवगत रहें",
  "navigation.advent": "टाइपस्क्रिप्ट का एडवेंट",
  "navigation.explore": "एक्सप्लोर",
  "navigation.tracks": "ट्रैक्स",
  "footsies.TermsOfService": "सेवा की शर्तें",
  "footsies.PrivacyPolicy": "गोपनीयता नीति",
  "footsies.built": "ट्रैश डेव्स \n समुदाय द्वारा {icon} के साथ बनाया गया।",
  "footsies.onGithub": "जीथब पर हीरो टाइप करें",
  "footsies.onTwitter": "ट्विटर पर हीरो टाइप करें",
} as const;
